# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import sqlite3 
import pandas as pd
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

In [3]:
def mysql(query):
    c.execute(str(query))
    df = pd.DataFrame(c.fetchall())
    df.columns = [x[0] for x in c.description]
    return df

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [4]:
#Your code here
mysql("""SELECT * FROM employees JOIN offices USING(officeCode) WHERE city == 'Boston'""")

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143,Sales Rep,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
1,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143,Sales Rep,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [5]:
#Your code here
mysql("""SELECT city, COUNT(*) FROM offices LEFT JOIN employees USING(officeCode) GROUP BY 1""")

            city  COUNT(*)
0         Boston         2
1         London         2
2            NYC         2
3          Paris         5
4  San Francisco         6
5         Sydney         4
6          Tokyo         2

## Write 3 Questions of your own and answer them

In [6]:
# Answers will vary
# 1.  Who are the customers for each employee?
# 2.  What's the quantity ordered for each product?
# 3.  What are the customer's order number?

In [14]:
# Your code here
mysql("""SELECT lastName, firstName, customerName FROM employees JOIN customers ON employees.lastName = customers.contactLastName;""")

    lastName firstName                  customerName
0     Murphy     Diane               Mini Wheels Co.
1     Murphy     Diane              Super Scale Inc.
2   Thompson    Leslie  Collectable Mini Designs Co.
3   Thompson    Leslie   West Coast Collectables Co.
4      Tseng  Foon Yue    Cambridge Collectables Co.
5  Hernandez    Gerard          Classic Legends Inc.
6  Hernandez    Gerard          Marta's Replicas Co.
7       King       Tom               Gift Depot Inc.
8       King       Tom            Signal Gift Stores

In [23]:
# Your code here
mysql("""SELECT productName, quantityOrdered FROM products JOIN orderdetails USING(productCode) GROUP BY productName ORDER BY quantityOrdered DESC LIMIT 10""")

                           productName quantityOrdered
0                   1969 Dodge Charger              97
1                 1969 Dodge Super Bee              90
2       America West Airlines B757-200              85
3              1970 Plymouth Hemi Cuda              77
4                   F/A 18 Hornet 1/72              77
5             1917 Grand Touring Sedan              76
6                   1949 Jaguar XK 120              76
7              1956 Porsche 356A Coupe              76
8             1962 Volkswagen Microbus              70
9  1932 Alfa Romeo 8C2300 Spider Sport              66

In [24]:
# Your code here
mysql("""SELECT customerName, orderNumber FROM customers JOIN orders USING(customerNumber)""")

                       customerName orderNumber
0                 Atelier graphique       10123
1                 Atelier graphique       10298
2                 Atelier graphique       10345
3                Signal Gift Stores       10124
4                Signal Gift Stores       10278
5                Signal Gift Stores       10346
6        Australian Collectors, Co.       10120
7        Australian Collectors, Co.       10125
8        Australian Collectors, Co.       10223
9        Australian Collectors, Co.       10342
10       Australian Collectors, Co.       10347
11                La Rochelle Gifts       10275
12                La Rochelle Gifts       10315
13                La Rochelle Gifts       10375
14                La Rochelle Gifts       10425
15               Baane Mini Imports       10103
16               Baane Mini Imports       10158
17               Baane Mini Imports       10309
18               Baane Mini Imports       10325
19     Mini Gifts Distributors Ltd.       10113
20     Mini Gifts Distributors Ltd.       10135
21     Mini Gifts Distributors Ltd.       10142
22     Mini Gifts Distributors Ltd.       10182
23     Mini Gifts Distributors Ltd.       10229
24     Mini Gifts Distributors Ltd.       10271
25     Mini Gifts Distributors Ltd.       10282
26     Mini Gifts Distributors Ltd.       10312
27     Mini Gifts Distributors Ltd.       10335
28     Mini Gifts Distributors Ltd.       10357
29     Mini Gifts Distributors Ltd.       10368
..                              ...         ...
296                 Microscale Inc.       10242
297                 Microscale Inc.       10319
298      Corrida Auto Replicas, Ltd       10126
299      Corrida Auto Replicas, Ltd       10214
300      Corrida Auto Replicas, Ltd       10348
301                FunGiftIdeas.com       10166
302                FunGiftIdeas.com       10321
303                FunGiftIdeas.com       10388
304    Australian Collectables, Ltd       10193
305    Australian Collectables, Ltd       10265
306    Australian Collectables, Ltd       10415
307              Frau da Collezione       10157
308              Frau da Collezione       10218
309     West Coast Collectables Co.       10199
310     West Coast Collectables Co.       10215
311      Iberia Gift Imports, Corp.       10184
312      Iberia Gift Imports, Corp.       10303
313    Motor Mint Distributors Inc.       10109
314    Motor Mint Distributors Inc.       10236
315    Motor Mint Distributors Inc.       10331
316        Signal Collectibles Ltd.       10149
317        Signal Collectibles Ltd.       10219
318  Double Decker Gift Stores, Ltd       10186
319  Double Decker Gift Stores, Ltd       10213
320            Diecast Collectables       10207
321            Diecast Collectables       10243
322               Kelly's Gift Shop       10138
323               Kelly's Gift Shop       10179
324               Kelly's Gift Shop       10360
325               Kelly's Gift Shop       10399

[326 rows x 2 columns]

## Level Up: Display the names of each product each employee has sold

In [26]:
# Your code here
mysql("""SELECT lastName, firstName, productName 
FROM employees e 
JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber 
JOIN orders USING(customerNumber)
JOIN orderdetails USING(orderNumber)
JOIN products USING(productCode) LIMIT 10""")

   lastName firstName                                  productName
0  Jennings    Leslie                               1958 Setra Bus
1  Jennings    Leslie                       1940 Ford Pickup Truck
2  Jennings    Leslie                      1939 Cadillac Limousine
3  Jennings    Leslie  1996 Peterbilt 379 Stake Bed with Outrigger
4  Jennings    Leslie                            1968 Ford Mustang
5  Jennings    Leslie                           1968 Dodge Charger
6  Jennings    Leslie                      1970 Plymouth Hemi Cuda
7  Jennings    Leslie                           1969 Dodge Charger
8  Jennings    Leslie                  1948 Porsche 356-A Roadster
9  Jennings    Leslie                         1969 Dodge Super Bee

## Level Up: Display the Number of Products each employee has sold

In [31]:
#Your code here
mysql("""SELECT lastName, firstName, quantityOrdered AS prdocu
FROM employees e 
JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber 
JOIN orders USING(customerNumber)
JOIN orderdetails USING(orderNumber)
JOIN products USING(productCode) GROUP BY lastName ORDER BY quantityOrdered DESC LIMIT 10""")

    lastName firstName quantityOrdered
0     Bondur      Loui              59
1  Patterson     Steve              50
2      Jones     Barry              49
3      Tseng  Foon Yue              45
4     Fixter      Andy              42
5  Hernandez    Gerard              40
6   Thompson    Leslie              39
7   Jennings    Leslie              35
8   Castillo    Pamela              34
9   Firrelli     Julie              33

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!